In [2]:
import numpy as np
import pandas as pd
string_data=pd.Series(["aar","raa",np.nan,"gbb"])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [4]:
data=pd.Series([1,np.nan,2,np.nan,3])
data.dropna()

0    1.0
2    2.0
4    3.0
dtype: float64

In [5]:
data[data.notnull()]

0    1.0
2    2.0
4    3.0
dtype: float64

### dropna throws out any nan data by row default

In [17]:
data=pd.DataFrame([[1,6.5,3.],[1.,np.nan,np.nan],
                  [np.nan,np.nan,np.nan],[np.nan,6.5,3]])
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(axis=1,how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

### thresh

In [20]:
data=pd.DataFrame(np.random.randn(7,3))
data.iloc[:4,1]=np.nan;data.iloc[:2,2]=np.nan

In [21]:
data

          0         1         2
0  2.724024       NaN       NaN
1  0.298993       NaN       NaN
2  1.515798       NaN -0.160489
3 -0.739467       NaN  0.887700
4  0.312523  1.490389 -0.516732
5  0.905019  0.352983 -0.161078
6 -1.640491 -1.344017  0.067252

In [23]:
data.dropna(thresh=2)

          0         1         2
2  1.515798       NaN -0.160489
3 -0.739467       NaN  0.887700
4  0.312523  1.490389 -0.516732
5  0.905019  0.352983 -0.161078
6 -1.640491 -1.344017  0.067252

### fillna

In [24]:
data

          0         1         2
0  2.724024       NaN       NaN
1  0.298993       NaN       NaN
2  1.515798       NaN -0.160489
3 -0.739467       NaN  0.887700
4  0.312523  1.490389 -0.516732
5  0.905019  0.352983 -0.161078
6 -1.640491 -1.344017  0.067252

In [25]:
data.fillna(0)

          0         1         2
0  2.724024  0.000000  0.000000
1  0.298993  0.000000  0.000000
2  1.515798  0.000000 -0.160489
3 -0.739467  0.000000  0.887700
4  0.312523  1.490389 -0.516732
5  0.905019  0.352983 -0.161078
6 -1.640491 -1.344017  0.067252

In [26]:
data.fillna({1:0.5,3:0.2})##assign the columns

          0         1         2
0  2.724024  0.500000       NaN
1  0.298993  0.500000       NaN
2  1.515798  0.500000 -0.160489
3 -0.739467  0.500000  0.887700
4  0.312523  1.490389 -0.516732
5  0.905019  0.352983 -0.161078
6 -1.640491 -1.344017  0.067252

In [28]:
data.fillna(0,inplace=True)##change the value in the original dataframe

In [29]:
data

          0         1         2
0  2.724024  0.000000  0.000000
1  0.298993  0.000000  0.000000
2  1.515798  0.000000 -0.160489
3 -0.739467  0.000000  0.887700
4  0.312523  1.490389 -0.516732
5  0.905019  0.352983 -0.161078
6 -1.640491 -1.344017  0.067252

In [31]:
data=pd.DataFrame(np.random.randn(6,3))
data.iloc[2:,1]=np.nan;data.iloc[4:,2]=np.nan
data

          0         1         2
0  1.652111 -0.701025 -0.249990
1 -2.003696 -0.341906 -0.338060
2  0.750017       NaN -0.978654
3  0.320215       NaN -0.151391
4 -0.156776       NaN       NaN
5  1.326931       NaN       NaN

In [32]:
data.fillna(method="ffill")

          0         1         2
0  1.652111 -0.701025 -0.249990
1 -2.003696 -0.341906 -0.338060
2  0.750017 -0.341906 -0.978654
3  0.320215 -0.341906 -0.151391
4 -0.156776 -0.341906 -0.151391
5  1.326931 -0.341906 -0.151391

In [33]:
data.fillna(method="ffill",limit=2)

          0         1         2
0  1.652111 -0.701025 -0.249990
1 -2.003696 -0.341906 -0.338060
2  0.750017 -0.341906 -0.978654
3  0.320215 -0.341906 -0.151391
4 -0.156776       NaN -0.151391
5  1.326931       NaN -0.151391

In [34]:
data=pd.Series([1.,np.nan,3.5,np.nan,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64